soap_old/sampleFiles/sampleFile.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Header xmlns:wsa5="http://www.w3.org/2005/08/addressing"><wsa5:To>http://13.57.207.202:8080/efs-mount-point/bill_test/1php_test/simple_xml.php</wsa5:To><wsa5:Action>/BootNotification</wsa5:Action><wsa5:MessageID>uuid:eeb8042d-b9b9-4466-97d5-949f81ffd6e6</wsa5:MessageID><wsa5:From><wsa5:Address>http://192.168.0.164:12801/Ocpp/ChargePointService</wsa5:Address></wsa5:From><chargeBoxIdentity xmlns="urn://Ocpp/Cs/2012/06/">DEMO_DA_2</chargeBoxIdentity></S:Header><S:Body><ocpp:bootNotificationRequest xmlns:ocpp="urn://Ocpp/Cs/2012/06/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><ocpp:chargePointVendor>Keba AG</ocpp:chargePointVendor><ocpp:chargePointModel>KC-P30-ES2400C2-E0R</ocpp:chargePointModel><ocpp:chargePointSerialNumber>17914498</ocpp:chargePointSerialNumber><ocpp:chargeBoxSerialNumber>17914498</ocpp:chargeBoxSerialNumber><ocpp:firmwareVersion>1.7.0</ocpp:firmwareVersion><ocpp:iccid>89430103017170051489</ocpp:iccid><ocpp:imsi>232010850429803</ocpp:imsi></ocpp:bootNotificationRequest></S:Body></S:Envelope>