xml/1.5/FirmwareStatusNotification.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://Ocpp/Cs/2012/06/">
    <x:Header>
        <ns:chargeBoxIdentity>?</ns:chargeBoxIdentity>
    </x:Header>
    <x:Body>
        <ns:firmwareStatusNotificationRequest>
            <ns:status>Downloaded</ns:status>
        </ns:firmwareStatusNotificationRequest>
    </x:Body>
</x:Envelope>