xml/StopTransaction.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://Ocpp/Cs/2012/06/">
    <x:Header>
        <ns:chargeBoxIdentity>?</ns:chargeBoxIdentity>
    </x:Header>
    <x:Body>
        <ns:stopTransactionRequest>
            <ns:transactionId>0</ns:transactionId>
            <ns:idTag>?</ns:idTag>
            <ns:timestamp>2017-03-05T00:00:00</ns:timestamp>
            <ns:meterStop>0</ns:meterStop>
            <ns:transactionData>
                <ns:values>
                    <ns:timestamp>2017-03-05T00:00:00</ns:timestamp>
                    <ns:value context="?" format="?" measurand="?" location="?" unit="?"/>
                </ns:values>
            </ns:transactionData>
        </ns:stopTransactionRequest>
    </x:Body>
</x:Envelope>