xml/StartTransaction.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://Ocpp/Cs/2012/06/">
    <x:Header>
        <ns:chargeBoxIdentity>?</ns:chargeBoxIdentity>
    </x:Header>
    <x:Body>
        <ns:startTransactionRequest>
            <ns:connectorId>0</ns:connectorId>
            <ns:idTag>?</ns:idTag>
            <ns:timestamp>2017-03-05T00:00:00</ns:timestamp>
            <ns:meterStart>0</ns:meterStart>
            <ns:reservationId>0</ns:reservationId>
        </ns:startTransactionRequest>
    </x:Body>
</x:Envelope>